redditclone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(subs_param)
        @sub.user_id = current_user.id
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sub1"], ["description", "this is sub1"], ["user_id", 1], ["created_at", "2021-07-30 19:20:48.147216"], ["updated_at", "2021-07-30 19:20:48.147216"]]