redditclone/app/models/user.rb

    def reset_session_token
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "GNCTSFMC96o4WF3pIy3WAA=="], ["updated_at", "2021-07-30 17:49:57.163885"], ["id", 1]]